# IsMasking Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
FilledRegionType..::..IsMasking Property
FilledRegionType Class See Also
---
If true then the FilledRegion will cover the lines and edges of objects behind it. If false then lines and edges will remain visible.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2019
# Syntax
C#
---
```text
public bool IsMasking { get; set; }
```

Visual Basic
---
```text
Public Property IsMasking As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsMasking {
	bool get ();
	void set (bool value);
}
```

# See Also
FilledRegionType Class
Autodesk.Revit.DB Namespace